################################################################################
# TITLE        :: CH09. 데이터 유형 파악하기
# AUTHOR       :: DATA_ANALYTICS_WITH_R, CHOE SANG HEON
# CREATED DATE :: 2021-09-06 (FRI)
# UPDATED DATE :: 2022-05-08 (SUN)

################################################################################
#09.1 문자(Character)
#(1) 문자형 데이터의 정의
#SKIP

#(2) 예시
chr_01 <- "Data Analytics With R"

################################################################################
#09.2. 숫자(Number)
#(1) 숫자형 데이터의 정의
#SKIP

#(2) 예시
int_01 <- 3L
num_01 <- 3

#PLUS) 복소수
#SKIP

################################################################################
#09.3. 논리(Logical)
#(1) 논리형 데이터의 정의
#SKIP

#(2) 예시
logical_01 <- TRUE
logical_02 <- T
logical_03 <- True

#PLUS) 특수값
#SKIP

################################################################################
#09.4. 팩터(Factor, 범주)
#(1) 팩터형의 정의
#SKIP

#(2) 팩터 생성함수, factor()
#SKIP

#(3) 예시
chr_02 <- "f"
chr_03 <- "m"
factor_01 <- factor(
  x=chr_02,
  levels=c("f", "m"),
  labels=c("female", "male"),
  ordered=FALSE 
)
factor_02 <- factor(
  x=chr_03,
  levels=c("f", "m"),
  labels=c("female", "male"),
  ordered=FALSE 
)  

################################################################################
#09.5. 날짜(Date)
#SKIP

################################################################################